In [1]:
import pandas as pd
import numpy as np
from datetime import datetime

In [2]:
# Datos de los departamentos
departments_data = {
    "department_id": [1, 2, 3, 4, 5, 6],
    "department_name": ["Sales", "Marketing", "IT", "Human Resources", "Finance", "Operations"]
}

# Datos de los puestos de trabajo
positions_data = {
    "position_id": [101, 102, 103, 104, 105, 106],
    "position_name": ["Manager", "Analyst", "Developer", "HR Specialist", "Accountant", "Data Engineer"]
}

# Datos de los empleados
np.random.seed(0)
employees_data = {
    "employee_id": np.arange(1, 101),
    "employee_name": [f"Employee{i}" for i in range(1, 101)],
    "department_id": np.random.choice([1, 2, 3, 4, 5], 100),
    "position_id": np.random.choice([101, 102, 103, 104, 105], 100),
    "hire_date": [datetime(2021, np.random.randint(1, 13), np.random.randint(1, 29)) for _ in range(100)]
}

# Convertir a DataFrame
departments_df = pd.DataFrame(departments_data)
positions_df = pd.DataFrame(positions_data)
employees_df = pd.DataFrame(employees_data)

In [5]:
departments_df

   department_id  department_name
0              1            Sales
1              2        Marketing
2              3               IT
3              4  Human Resources
4              5          Finance
5              6       Operations

In [6]:
positions_df

   position_id  position_name
0          101        Manager
1          102        Analyst
2          103      Developer
3          104  HR Specialist
4          105     Accountant
5          106  Data Engineer

In [7]:
employees_df

    employee_id employee_name  department_id  position_id  hire_date
0             1     Employee1              5          103 2021-10-24
1             2     Employee2              1          104 2021-06-20
2             3     Employee3              4          103 2021-05-22
3             4     Employee4              4          102 2021-04-04
4             5     Employee5              4          103 2021-08-10
..          ...           ...            ...          ...        ...
95           96    Employee96              2          105 2021-03-17
96           97    Employee97              1          101 2021-09-19
97           98    Employee98              3          103 2021-08-25
98           99    Employee99              3          104 2021-05-05
99          100   Employee100              4          104 2021-02-24

[100 rows x 5 columns]